# 1
id = input()

if id == "joonas":
  print(id+"??!")

# 2
print(input() + "??!")

"""
print(input() + "??!")가 아닌, print(input(),"??!")를 하면 입력받은 문자열 뒤에 공백이 포함된다.

print에는 변수나 값 여러 개를 ,(콤마)로 구분하여 넣을 수 있다.
print에 변수나 값을 콤마로 구분해서 넣으면 각 값이 공백으로 띄워져서 한 줄로 출력된다.
값 사이에 공백이 아닌 다른 문자를 넣고싶다면 다음과 같이 지정해줄 수 있다.

print(input(), "??!", sep="") # sep에 사용하고싶은 값을 지정한다.
"""

"""
아무래도 난독증이 있는 것 같다.
문제 읽고 #1과 같이 코딩하였다. 문제를 제대로 읽지 않았단 소리다.
빨간색으로 틀렸습니다!라고 뜰때 인생이 부정당하는 기분이 들었는데... 내가 바보였다.
근데 많은 사람들이 당한것같다. 이정도면 낙시성문제 아닌가?
"""


